{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "fb9d08c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/a.zhang@PTW.Maschinenbau.TU-Darmstadt.de/project/.venv/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from typing import List\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "from langchain_core.documents import Document\n",
    "from langchain_core.runnables import RunnableLambda, RunnablePassthrough\n",
    "from langchain_core.output_parsers import StrOutputParser"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0d6d9e2a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = \"\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"\"\n",
    "\n",
    "driver = GraphDatabase.driver(\n",
    "    os.environ[\"NEO4J_URI\"],\n",
    "    auth=(\n",
    "        os.environ[\"NEO4J_USERNAME\"],\n",
    "        os.environ[\"NEO4J_PASSWORD\"]\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "cee4ad82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "684\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    result = session.run(\"MATCH (n) RETURN count(n)\")\n",
    "    print(result.single()[0])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6dc7ba9b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/a.zhang@PTW.Maschinenbau.TU-Darmstadt.de/project/RAGAS/eval_utils.py:55: LangChainDeprecationWarning: The class `HuggingFaceEmbeddings` was deprecated in LangChain 0.2.2 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-huggingface package and should be used instead. To use it run `pip install -U :class:`~langchain-huggingface` and import as `from :class:`~langchain_huggingface import HuggingFaceEmbeddings``.\n",
      "  return HuggingFaceEmbeddings(\n"
     ]
    }
   ],
   "source": [
    "from eval_utils import load_embeddings\n",
    "\n",
    "embedding = load_embeddings(model_id=\"sentence-transformers/all-MiniLM-L6-v2\",\n",
    "                            cache_dir=\"hf_models/embeddings/all-MiniLM-L6-v2\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4b8ba8de",
   "metadata": {},
   "source": [
    "Load Sentence Nodes from Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "210a449b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(617,\n",
       " Document(metadata={'id': 0, 'type': 'solution', 'source': '../data/mk4s_manuel/Extruder_blob.md'}, page_content='Extruder blob\\n=============\\n\\nThe blob (mass of plastic accumulated around the hotend) is one of the most scary-looking printing problems you might face with your 3D printer.'))"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def load_sentences_from_neo4j():\n",
    "    cypher = \"\"\"\n",
    "    MATCH (s:Sentence)\n",
    "    RETURN s.id AS id,\n",
    "           s.text AS text,\n",
    "           s.type AS type,\n",
    "           s.source AS source\n",
    "    \"\"\"\n",
    "    docs = []\n",
    "\n",
    "    with driver.session() as session:\n",
    "        for r in session.run(cypher):\n",
    "            docs.append(\n",
    "                Document(\n",
    "                    page_content=r[\"text\"],\n",
    "                    metadata={\n",
    "                        \"id\": r[\"id\"],\n",
    "                        \"type\": r[\"type\"],\n",
    "                        \"source\": r[\"source\"]\n",
    "                    }\n",
    "                )\n",
    "            )\n",
    "    return docs\n",
    "\n",
    "\n",
    "sentence_docs = load_sentences_from_neo4j()\n",
    "\n",
    "len(sentence_docs), sentence_docs[0]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "231d52fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.vectorstores import FAISS\n",
    "\n",
    "vectorstore = FAISS.from_documents(\n",
    "    sentence_docs,\n",
    "    embedding\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2daec059",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[Document(id='a9350843-933b-411a-8b5c-51bb51c6cd42', metadata={'id': 41, 'type': None, 'source': '../data/mk4s_manuel/Preheat_error.md'}, page_content='Troubleshooting\\n\\nPreheat error\\n\\n1.'),\n",
       " Document(id='1286dd77-652b-431d-a8dd-8f29cd3633a8', metadata={'id': 39, 'type': None, 'source': '../data/mk4s_manuel/Preheat_error.md'}, page_content='Preheat error\\xa0- a problem with preheating the hotend.'),\n",
       " Document(id='ea37523b-0704-4087-93f3-5682a631497e', metadata={'id': 50, 'type': None, 'source': '../data/mk4s_manuel/Preheat_error.md'}, page_content='Bed preheat error\\n\\n1.')]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "vectorstore.similarity_search(\n",
    "    \"How to fix preheat error?\",\n",
    "    k=3\n",
    ")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "63e2cca9",
   "metadata": {},
   "source": [
    "Entities retrieval"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "894e02f0",
   "metadata": {},
   "outputs": [],
   "source": [
    "def graph_retrieve(question: str, top_k: int = 6) -> List[Document]:\n",
    "    q = question.lower()\n",
    "\n",
    "    tokens = [t for t in q.replace(\"?\", \" \").replace(\",\", \" \").split() if len(t) >= 3]\n",
    "    cypher = \"\"\"\n",
    "    WITH $tokens AS tokens\n",
    "    MATCH (e:Entity)\n",
    "    WHERE any(t IN tokens WHERE e.name CONTAINS t)\n",
    "    MATCH (s:Sentence)-[:MENTIONS]->(e)\n",
    "    OPTIONAL MATCH (d:Document)-[:CONTAINS]->(s)\n",
    "    WITH s, d,\n",
    "         CASE s.type WHEN 'solution' THEN 3 WHEN 'fix' THEN 3 WHEN 'cause' THEN 1 ELSE 0 END AS score\n",
    "    RETURN s.text AS text,\n",
    "           s.type AS type,\n",
    "           coalesce(d.source, '') AS source,\n",
    "           score\n",
    "    ORDER BY score DESC\n",
    "    LIMIT $top_k\n",
    "    \"\"\"\n",
    "\n",
    "    docs = []\n",
    "    with driver.session() as session:\n",
    "        rows = session.run(cypher, tokens=tokens, top_k=top_k).data()\n",
    "\n",
    "    for r in rows:\n",
    "        docs.append(\n",
    "            Document(\n",
    "                page_content=r[\"text\"],\n",
    "                metadata={\n",
    "                    \"type\": r[\"type\"],\n",
    "                    \"source\": r[\"source\"],\n",
    "                    \"retrieval\": \"graph\"\n",
    "                }\n",
    "            )\n",
    "        )\n",
    "    return docs\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "9883e975",
   "metadata": {},
   "outputs": [],
   "source": [
    "def embedding_retrieve(question: str, top_k: int = 4) -> List[Document]:\n",
    "    return vectorstore.similarity_search(question, k=top_k)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1cdfdf0f",
   "metadata": {},
   "source": [
    "Hybrid Retrieval：Vector Search + Graph Search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "ab257e00",
   "metadata": {},
   "outputs": [],
   "source": [
    "def hybrid_retrieve(question: str,\n",
    "                    graph_k: int = 15,\n",
    "                    embed_k: int = 15) -> List[Document]:\n",
    "\n",
    "    graph_docs = graph_retrieve(question, top_k=graph_k)\n",
    "\n",
    "\n",
    "    if len(graph_docs) >= graph_k:\n",
    "        return graph_docs\n",
    "\n",
    "    embed_docs = embedding_retrieve(question, top_k=embed_k)\n",
    "\n",
    "    seen = set(d.page_content for d in graph_docs)\n",
    "    merged = graph_docs[:]\n",
    "\n",
    "    for d in embed_docs:\n",
    "        if d.page_content not in seen:\n",
    "            merged.append(d)\n",
    "            seen.add(d.page_content)\n",
    "\n",
    "    return merged\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "80331c3b",
   "metadata": {},
   "outputs": [],
   "source": [
    "retriever = RunnableLambda(lambda q: hybrid_retrieve(q))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a0fb554",
   "metadata": {},
   "source": [
    "Context Formatting & Prioritization"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "9273380b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def format_docs(docs: List[Document]) -> str:\n",
    "    def rank(d):\n",
    "        t = (d.metadata.get(\"type\") or \"\").lower()\n",
    "        return 0 if t in (\"solution\", \"fix\") else 1\n",
    "\n",
    "    docs = sorted(docs, key=rank)\n",
    "\n",
    "    lines = []\n",
    "    for i, d in enumerate(docs, 1):\n",
    "        lines.append(\n",
    "            f\"[{i}] ({d.metadata.get('type')}, via {d.metadata.get('retrieval')})\\n\"\n",
    "            f\"{d.page_content}\\n\"\n",
    "            f\"source: {d.metadata.get('source')}\"\n",
    "        )\n",
    "    return \"\\n\\n\".join(lines)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "38de4e93",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Loading checkpoint shards: 100%|██████████| 4/4 [00:03<00:00,  1.30it/s]\n",
      "Device set to use cuda:0\n"
     ]
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "import getpass\n",
    "import os\n",
    "from eval_utils import load_llm\n",
    "\n",
    "if not os.getenv(\"HUGGINGFACEHUB_API_TOKEN\"):\n",
    "    os.environ[\"HUGGINGFACEHUB_API_TOKEN\"] = getpass.getpass(\"Enter your token:\")\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "\n",
    "chat_model = load_llm(model_path=\"./hf_models/Llama-3.1-8B-Instruct\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "f0bed2ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import PromptTemplate\n",
    "\n",
    "template = \"\"\"You are a helpful assistant specializing in 3D printing operations.\n",
    "Use the following pieces of retrieved context to answer the question.\n",
    "If you don’t know the answer, just say that you don’t know.\n",
    "Use two sentences maximum and keep the answer concise.\n",
    "\n",
    "Question: {question}\n",
    "Context: {context}\n",
    "Answer:\n",
    "\"\"\"\n",
    "def format_docs(docs):\n",
    "    return \"\\n\\n\".join([d.page_content for d in docs])\n",
    "\n",
    "prompt = PromptTemplate.from_template(template)\n",
    "\n",
    "rag_chain = (\n",
    "    {\n",
    "        \"context\": retriever | RunnableLambda(format_docs),\n",
    "        \"question\": RunnablePassthrough()\n",
    "    }\n",
    "    | prompt\n",
    "    | chat_model\n",
    "    | StrOutputParser()\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "d55cd410",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"Make sure that the first layer is sticking properly to the entire print surface.\\n\\nFor example, if the blob is made of:\\n   \\n   * PLA:\\xa0preheat to 250°C\\n   * ABS/PETG:\\xa0preheat to 280°C\\n\\n2.\\n\\n6.\\n\\n_Turn the printer off before the next step, or you might cause an electrical short.\\n\\nAlways make sure to\\xa0clean the print surface\\xa0before starting the print.\\n\\nFor example, if the blob is made of:\\n   \\n   * PLA:\\xa0preheat to 250°C\\n   * ABS/PETG:\\xa0preheat to 280°C\\n\\n2.\\n\\n6.\\n\\nWork very carefully, you don't want to melt the printed parts surrounding the hotend.\\n\\nHow to prevent this problem from happening\\n\\nUnlike the\\xa0Spaghetti monster\\xa0issue, the blob issue often occurs early during the print.\\n\\nIf\\xa0MINTEMP\\xa0or\\xa0Preheat error\\xa0message appears on the LCD, it means the thermistor or the heater cable (respectively) is already broken.\\n\\nIn case you do not succeed, as well as in case the blob has damaged some of the extruder parts, you can find your spare parts\\xa0here.\\n\\nWork very carefully, you don't want to melt the printed parts surrounding the hotend.\\n\\nHow to prevent this problem from happening\\n\\nUnlike the\\xa0Spaghetti monster\\xa0issue, the blob issue often occurs early during the print.\\n\\nOnce the big chunks of the amassed plastic are removed, use a small brass brush to get rid of what's left (as shown in the video above).\\n\\nAs for the bigger ones, use a pair of pliers to remove the now soft plastic mass from the hotend carefully.\""
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "(retriever | RunnableLambda(format_docs)).invoke(\n",
    "    \"What are the recommended steps for checking belt tension and ensuring proper motor pulley alignment on both the Original Prusa MK-series and Original Prusa XL printers?\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "4e2cd052",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'To check belt tension and ensure proper motor pulley alignment on both the Original Prusa MK-series and Original Prusa XL printers, turn the printer off, then loosen the belt tension screws and align the pulleys while checking for any obstructions or blockages.'"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rag_chain.invoke(\"What are the recommended steps for checking belt tension and ensuring proper motor pulley alignment on both the Original Prusa MK-series and Original Prusa XL printers?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74d05347",
   "metadata": {},
   "source": [
    "Build Chain and Evaluation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "3261e9c2",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import time\n",
    "from ragas import EvaluationDataset\n",
    "from ragas import evaluate, RunConfig\n",
    "from ragas.metrics import LLMContextPrecisionWithReference, LLMContextRecall, AnswerAccuracy, AnswerRelevancy, Faithfulness, FactualCorrectness\n",
    "from eval_utils import load_eval_model\n",
    "\n",
    "\n",
    "def get_eval_ds(path, retriever, rag_chain):\n",
    "\n",
    "    testset = pd.read_csv(path)\n",
    "    queries = testset[\"user_input\"].to_list()\n",
    "    references = testset[\"reference\"].to_list()\n",
    "\n",
    "    # generate evaluation dataset\n",
    "    rs_times = []\n",
    "    dataset = []\n",
    "\n",
    "    for query, reference in zip(queries, references):\n",
    "\n",
    "        \n",
    "        relevant_docs = [doc.page_content for doc in retriever.invoke(query)]\n",
    "        # measure response time\n",
    "        t0 = time.perf_counter()\n",
    "        response = rag_chain.invoke(query)\n",
    "        t1 = time.perf_counter()\n",
    "        \n",
    "        dataset.append(\n",
    "            {\n",
    "                \"user_input\": query,\n",
    "                \"retrieved_contexts\": relevant_docs,\n",
    "                \"response\": response,\n",
    "                \"reference\": reference,\n",
    "            }\n",
    "        )\n",
    "        rs_times.append(t1 -t0)\n",
    "\n",
    "    eval_ds = EvaluationDataset.from_list(dataset)\n",
    "\n",
    "    return eval_ds, rs_times\n",
    "\n",
    "def get_eval_result(eval_ds, metrics):\n",
    "    evaluator_llm = load_eval_model()\n",
    "\n",
    "    run_config = RunConfig(\n",
    "    timeout=600,      \n",
    "    max_workers=2,    \n",
    "    max_retries=2,    \n",
    "    max_wait=600,     \n",
    ")\n",
    "    result = evaluate(\n",
    "        dataset=eval_ds,\n",
    "        metrics=metrics,\n",
    "        llm=evaluator_llm,\n",
    "        run_config=run_config,\n",
    "        )\n",
    "    \n",
    "    return result\n",
    "\n",
    "metrics=[LLMContextPrecisionWithReference(),\n",
    "         LLMContextRecall(), \n",
    "         AnswerAccuracy(),\n",
    "         AnswerRelevancy(),\n",
    "         Faithfulness(),\n",
    "         FactualCorrectness(mode = 'f1', atomicity='high', coverage='high')]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "e9f60a08",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "You seem to be using the pipelines sequentially on GPU. In order to maximize efficiency please use a dataset\n"
     ]
    }
   ],
   "source": [
    "data_path = \"evaluate_dataset/test_dataset.csv\"\n",
    "\n",
    "eval_ds, rs_times = get_eval_ds(data_path, retriever, rag_chain)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "46770d14",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Evaluating:  36%|███▋      | 87/240 [09:37<14:44,  5.78s/it]LLM returned 1 generations instead of requested 3. Proceeding with 1 generations.\n",
      "Evaluating: 100%|██████████| 240/240 [30:55<00:00,  7.73s/it]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'llm_context_precision_with_reference': 0.1835, 'context_recall': 0.5739, 'nv_accuracy': 0.4125, 'answer_relevancy': 0.9160, 'faithfulness': 0.6375, 'factual_correctness(mode=f1)': 0.3443}"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = get_eval_result(eval_ds, metrics)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dca4f906",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = result.to_pandas()\n",
    "df['response_time'] = rs_times\n",
    "df.to_csv(\"./evaluate_results/09_KG_test/rule_based_test.csv\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.12.3)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
